[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.js:29:25
     // const yyyyq_regex = /((19)|(20))\d{2}[1-4]/i; // Accepts from 1900-2099 followed by 1-4.  Close enough.
 
     const int_regex = /^\d+$/i;
-    const stars_regex = /^[0-5]$/i;
+    const stars_regex = /^[^0-5]$/i;
 
     const testIdPrefix = "MenuItemReviewForm";
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:40:14
 
             <Row>
 
-            {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid={testIdPrefix + "-id"}
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+            {true}
 
                 <Col>
killedBy: MenuItemReviewForm tests renders correctly when passing in a Menu Item Review
statusReason: Error: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:64:64
                             id="itemId"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", { required: true, pattern: int_regex })}
+                            {...register("itemId", { required: false, pattern: int_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:64:42
                             id="itemId"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", { required: true, pattern: int_regex })}
+                            {...register("", { required: true, pattern: int_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:68:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required.'}
-                            {errors.itemId?.type === 'pattern' && ' Item ID must be a positive integer'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item ID must be a positive integer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:68:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required.'}
-                            {errors.itemId?.type === 'pattern' && ' Item ID must be a positive integer'}
+                            {true && ' Item ID must be a positive integer'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback"> Item ID must be a positive integer</div> instead

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:80:71
                             id="reviewerEmail"
                             type="text"
                             isInvalid={Boolean(errors.reviewerEmail)}
-                            {...register("reviewerEmail", { required: true})}
+                            {...register("reviewerEmail", { required: false})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:80:42
                             id="reviewerEmail"
                             type="text"
                             isInvalid={Boolean(errors.reviewerEmail)}
-                            {...register("reviewerEmail", { required: true})}
+                            {...register("", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:83:30
                             {...register("reviewerEmail", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && "Reviewer Email is required."}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:83:30
                             {...register("reviewerEmail", { required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && "Reviewer Email is required."}
+                            {errors.reviewerEmail || "Reviewer Email is required."}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Reviewer Email/

Here are the matching elements:

<label
  class="form-label"
  for="reviewerEmail"
>

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:98:26
                             {...register("stars", { required: true, pattern: stars_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                        {errors.stars && 'Stars are required. '}
+                        {false}
                         {errors.stars?.type === 'pattern' && 'Stars must be a positive integer ranging from 0-5'}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:99:26
                         />
                         <Form.Control.Feedback type="invalid">
                         {errors.stars && 'Stars are required. '}
-                        {errors.stars?.type === 'pattern' && 'Stars must be a positive integer ranging from 0-5'}
+                        {errors.stars?.type === 'pattern' || 'Stars must be a positive integer ranging from 0-5'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Stars must be a positive integer ranging from 0-5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:99:26
                         />
                         <Form.Control.Feedback type="invalid">
                         {errors.stars && 'Stars are required. '}
-                        {errors.stars?.type === 'pattern' && 'Stars must be a positive integer ranging from 0-5'}
+                        {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Stars must be a positive integer ranging from 0-5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
