[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/menuitemreviews/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuitemreviews/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:14:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/menuitemreviews/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuitemreviews/edit/1"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:60:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "MenuItemReviewsTable"));
     } 
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:60:71
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     } 
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewsTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
