[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:28:28
                 <Button
                     variant="primary"
                     href="/restaurants/create"
-                    style={{ float: "right" }}
+                    style={{}}
                 >
                     Create Restaurant
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
