[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:33:42
                             id="orgCode"
                             type="text"
                             isInvalid={Boolean(errors.orgCode)}
-                            {...register("orgCode", { required: "orgCode is required." })}
+                            {...register("", { required: "orgCode is required." })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:49:65
                             id="orgTranslationShort"
                             type="text"
                             isInvalid={Boolean(errors.orgTranslationShort)}
-                            {...register("orgTranslationShort", { required: "orgTranslationShort is required." })}
+                            {...register("orgTranslationShort", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslationShort is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:64:42
                             id="orgTranslation"
                             type="text"
                             isInvalid={Boolean(errors.orgTranslation)}
-                            {...register("orgTranslation", { required: "orgTranslation is required." })}
+                            {...register("", { required: "orgTranslation is required." })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationForm.js:79:110
                             id="inactive"
                             type="boolean"
                             isInvalid={Boolean(errors.inactive)}
-                            {...register("inactive", { required: true, validate: value => value == 'true' || value == 'false' })}
+                            {...register("inactive", { required: true, validate: value => value == 'true' || false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ArrowFunction
main/components/UCSBOrganizations/UCSBOrganizationForm.js:79:82
                             id="inactive"
                             type="boolean"
                             isInvalid={Boolean(errors.inactive)}
-                            {...register("inactive", { required: true, validate: value => value == 'true' || value == 'false' })}
+                            {...register("inactive", { required: true, validate: () => undefined })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests Correct Error message if invalid is filled with non-boolean value
statusReason: Error: Unable to find an element with the text: /inactive must be either true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationForm.js:82:30
                             {...register("inactive", { required: true, validate: value => value == 'true' || value == 'false' })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.inactive && "inactive is required." }
+                            {false }
                             {errors.inactive?.type == 'validate' && 'inactive must be either true or false.'}
                         </Form.Control.Feedback>
killedBy: UCSBOrganizationForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBOrganizations/UCSBOrganizationForm.js:82:30
                             {...register("inactive", { required: true, validate: value => value == 'true' || value == 'false' })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.inactive && "inactive is required." }
+                            {errors.inactive || "inactive is required." }
                             {errors.inactive?.type == 'validate' && 'inactive must be either true or false.'}
                         </Form.Control.Feedback>
killedBy: UCSBOrganizationForm tests Correct Error message if invalid is filled with non-boolean value
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationForm.js:83:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.inactive && "inactive is required." }
-                            {errors.inactive?.type == 'validate' && 'inactive must be either true or false.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationForm tests Correct Error message if invalid is filled with non-boolean value
statusReason: Error: Unable to find an element with the text: /inactive must be either true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationForm.js:83:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.inactive && "inactive is required." }
-                            {errors.inactive?.type == 'validate' && 'inactive must be either true or false.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationForm tests Correct Error message if invalid is filled with non-boolean value
statusReason: Error: Unable to find an element with the text: /inactive must be either true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
