[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationTable.js:30:21
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
 
-    const columns = [
-        {
-            Header: 'OrgCode',
-            accessor: 'orgCode', // accessor is the "key" in the data
-        },
-        {
-            Header: 'OrgTranslationShort',
-            accessor: 'orgTranslationShort',
-        },
-        {
-            Header: 'OrgTranslation',
-            accessor: 'orgTranslation',
-        },
-        {
-            Header: 'Inactive',
-            accessor: 'inactive',
-        }
-    ];
+    const columns = [];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationIndexPage tests renders three dates correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:39:9
             Header: 'OrgTranslationShort',
             accessor: 'orgTranslationShort',
         },
-        {
-            Header: 'OrgTranslation',
-            accessor: 'orgTranslation',
-        },
+        {},
         {
             Header: 'Inactive',
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:45:23
         },
         {
             Header: 'Inactive',
-            accessor: 'inactive',
+            accessor: "",
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-inactive"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/UCSBOrganizations/UCSBOrganizationTable.js:54:47
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"));
     } 
 
-    const orgsWithInactiveToString = orgs.map(org => ({
-        ...org,
-        inactive: org.inactive ? 'true' : 'false'
-    }));
+    const orgsWithInactiveToString = orgs.map(() => undefined);
 
     return <OurTable
killedBy: UCSBOrganizationIndexPage tests renders three dates correctly for regular user
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:54:55
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"));
     } 
 
-    const orgsWithInactiveToString = orgs.map(org => ({
-        ...org,
-        inactive: org.inactive ? 'true' : 'false'
-    }));
+    const orgsWithInactiveToString = orgs.map(org => ({}));
 
     return <OurTable
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ZBT
Received:

[Survived] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:56:43
 
     const orgsWithInactiveToString = orgs.map(org => ({
         ...org,
-        inactive: org.inactive ? 'true' : 'false'
+        inactive: org.inactive ? 'true' : ""
     }));
 

[Survived] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:56:34
 
     const orgsWithInactiveToString = orgs.map(org => ({
         ...org,
-        inactive: org.inactive ? 'true' : 'false'
+        inactive: org.inactive ? "" : 'false'
     }));
 
