[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationCreatePage.js:9:31
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbOrg) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-      orgCode: ucsbOrg.orgCode,
-      orgTranslationShort: ucsbOrg.orgTranslationShort,
-      orgTranslation: ucsbOrg.orgTranslation,
-      inactive: ucsbOrg.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbOrg) => {
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationCreatePage.js:9:45
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbOrg) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-      orgCode: ucsbOrg.orgCode,
-      orgTranslationShort: ucsbOrg.orgTranslationShort,
-      orgTranslation: ucsbOrg.orgTranslation,
-      inactive: ucsbOrg.inactive
-    }
-  });
+  const objectToAxiosParams = (ucsbOrg) => ({});
 
   const onSuccess = (ucsbOrg) => {
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationCreatePage.js:10:10
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
   const objectToAxiosParams = (ucsbOrg) => ({
-    url: "/api/ucsborganizations/post",
+    url: "",
     method: "POST",
     params: {
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbOrganization Created - orgCode: TT orgTranslation: TT at UCSB"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationCreatePage.js:20:34
     }
   });
 
-  const onSuccess = (ucsbOrg) => {
-    toast(`New ucsbOrganization Created - orgCode: ${ucsbOrg.orgCode} orgTranslation: ${ucsbOrg.orgTranslation}`);
-  }
+  const onSuccess = (ucsbOrg) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbOrganization Created - orgCode: TT orgTranslation: TT at UCSB"

Number of calls: 0

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationCreatePage.js:37:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsborganizations" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBOrganizationCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsborganizations"}

Number of calls: 0
