[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/ucsborganizations`,
-        params: {
-          orgCode
-        }
+        params: {}
       }
     );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (ucsbOrg) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      orgCode: ucsbOrg.orgCode,
-    },
-    data: {
-      orgTranslationShort: ucsbOrg.orgTranslationShort,
-      orgTranslation: ucsbOrg.orgTranslation,
-      inactive: ucsbOrg.inactive
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbOrg) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization Updated - orgCode: ZBT orgTranslation: Zebra Bread Toast at SLO"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.js:26:10
 
 
   const objectToAxiosPutParams = (ucsbOrg) => ({
-    url: "/api/ucsborganizations",
+    url: "",
     method: "PUT",
     params: {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization Updated - orgCode: ZBT orgTranslation: Zebra Bread Toast at SLO"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.js:38:34
     }
   });
 
-  const onSuccess = (ucsbOrg) => {
-    toast(`UCSBOrganization Updated - orgCode: ${ucsbOrg.orgCode} orgTranslation: ${ucsbOrg.orgTranslation}`);
-  }
+  const onSuccess = (ucsbOrg) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.js:64:11
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
         {
-          ucsbOrg && <UCSBOrganizationForm initialContents={ucsbOrg} submitAction={onSubmit} buttonLabel="Update" />
+          ucsbOrg || <UCSBOrganizationForm initialContents={ucsbOrg} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {orgCode, orgTranslationShort, orgTranslation, inactive}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/UCSBOrganizations/UCSBOrganizationEditPage.js:64:11
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
         {
-          ucsbOrg && <UCSBOrganizationForm initialContents={ucsbOrg} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
